## Practice Pandas

### Answer the following questions and then push your jupyter notebook code to github. Please add `nasimtaba` as the collaborator to your github repo.

In [1]:
import pandas as pd

In [2]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

**1- Create a DataFrame called `df` from the above dictionary**

In [4]:
df = pd.DataFrame(dict)
df

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

Double-click __here__ for the solution.

<!-- Your answer is below:
# create a DataFrame called df
df = pd.DataFrame(dict)
df
-->

**2- Set the index for `df` - ["BR", "RU", "IN", "CH", "SA"]**

In [6]:
df.index = ["BR","RU","IN","CH","SA"]
df

         country    capital    area  population
BR        Brazil   Brasilia   8.516      200.40
RU        Russia     Moscow  17.100      143.50
IN         India  New Dehli   3.286     1252.00
CH         China    Beijing   9.597     1357.00
SA  South Africa   Pretoria   1.221       52.98

Double-click __here__ for the solution.

<!-- Your answer is below:
# Set the index for df - ["BR", "RU", "IN", "CH", "SA"]
df.index = ["BR", "RU", "IN", "CH", "SA"]
-->

**3- Print out country column as Pandas Series**

In [10]:
pd.Series(data= df['country'])

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

Double-click __here__ for the solution.

<!-- Your answer is below:
df['country']
-->

**4- Print out country column as data frame**

In [12]:
df_country = pd.DataFrame(df['country'])
df_country

         country
BR        Brazil
RU        Russia
IN         India
CH         China
SA  South Africa

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out country column as data frame 
df[['country']]
-->

**5- Print out a DataFrame with country and area columns**

In [17]:
df_country_area = pd.DataFrame(df[['country','area']])
df_country_area

         country    area
BR        Brazil   8.516
RU        Russia  17.100
IN         India   3.286
CH         China   9.597
SA  South Africa   1.221

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out country column as data frame 
df[['country', 'area]]
-->

**6- Print out the first 4 observations**

In [23]:
df.iloc[0:4]

   country    capital    area  population
BR  Brazil   Brasilia   8.516       200.4
RU  Russia     Moscow  17.100       143.5
IN   India  New Dehli   3.286      1252.0
CH   China    Beijing   9.597      1357.0

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out first 4 observations
df[0:4]
-->

**7- Print out fourth and fifth observations**

In [25]:
df.iloc[3:5]

         country   capital   area  population
CH         China   Beijing  9.597     1357.00
SA  South Africa  Pretoria  1.221       52.98

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out fourth and fifth observation
df[3:5]
-->

**8- Print out observation (row) for India**

In [26]:
df.iloc[2]

country           India
capital       New Dehli
area              3.286
population         1252
Name: IN, dtype: object

Double-click __here__ for the solution.

<!-- Your answer is below:
# Print out observation (row) for India
df.iloc[2]
df.loc['IN']
-->

**9- Get the area and population of china and India**

In [28]:
df.loc[['IN','CH'],['area','population']]

     area  population
IN  3.286      1252.0
CH  9.597      1357.0

Double-click __here__ for the solution.

<!-- Your answer is below:
# get the area and population of china and India
df.loc[['CH','IN'],['area','population']]
df.iloc[2:4,2:4]
-->

**10 - Read Grades.csv file into the pandas data frame and answer the following question:**
- using the head method returns the first five rows
- print out the column names
- print out the row names as a list
- Get the dimensions of the data frame with shape
- Get the data type of each column
- look at how many unique grades exist
- Get the mean, min, max of all the numric values

In [29]:
grades_df=pd.read_csv('Grades.csv')
grades_df

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32,1,19.5,20,1,10.0,33.0,A
1,Joe,32,1,20.0,16,1,14.0,32.0,A
2,Susan,30,1,19.0,19,1,10.5,33.0,A-
3,Sol,31,1,22.0,13,1,13.0,34.0,A
4,Chris,30,1,19.0,17,1,12.5,33.5,A

Double-click __here__ for the solution.

<!-- Your answer is below:
grades=pd.read_csv("Grades.csv")
grades.head()
list(grades.columns)
list(grades.index)
grades.shape
grades.dtypes
grades['Grade'].unique()
grades['Grade'].nunique()
grades_grouped = grades.groupby('Grade')
grades_grouped.mean()
grades_grouped.min()
grades_grouped.max()
grades_grouped.describe()
-->

In [30]:
grades_df.head(n=5)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32,1,19.5,20,1,10.0,33.0,A
1,Joe,32,1,20.0,16,1,14.0,32.0,A
2,Susan,30,1,19.0,19,1,10.5,33.0,A-
3,Sol,31,1,22.0,13,1,13.0,34.0,A
4,Chris,30,1,19.0,17,1,12.5,33.5,A

In [31]:
list(grades_df.columns)

['Name',
 'Previous_Part',
 'Participation1',
 'Mini_Exam1',
 'Mini_Exam2',
 'Participation2',
 'Mini_Exam3',
 'Final',
 'Grade']

In [72]:
list(grades_df.index)

[0, 1, 2, 3, 4]

In [37]:
shape = grades_df.shape
shape

(5, 9)

In [73]:
grades_df.dtypes

Name               object
Previous_Part       int64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
dtype: object

In [50]:
grades_df.Grade.unique()

array(['A', 'A-'], dtype=object)

In [75]:
grades_grouped = grades_df.groupby('Grade')
grades_grouped.mean()

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
Grade,,,,,,,
A,31.25,1.0,20.125,16.5,1.0,12.375,33.125
A-,30.00,1.0,19.000,19.0,1.0,10.500,33.000

In [76]:
grades_grouped.min()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
Grade,,,,,,,,
A,Chris,30,1,19.0,13,1,10.0,32.0
A-,Susan,30,1,19.0,19,1,10.5,33.0

In [77]:
grades_grouped.max()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
Grade,,,,,,,,
A,Sol,32,1,22.0,20,1,14.0,34.0
A-,Susan,30,1,19.0,19,1,10.5,33.0

In [78]:
grades_grouped.describe()

      Previous_Part                                                  \
              count   mean       std   min    25%   50%   75%   max
Grade
A               4.0  31.25  0.957427  30.0  30.75  31.5  32.0  32.0
A-              1.0  30.00       NaN  30.0  30.00  30.0  30.0  30.0

      Participation1       ... Mini_Exam3       Final                          \
               count mean  ...        75%   max count    mean       std   min
Grade                      ...
A                4.0  1.0  ...      13.25  14.0   4.0  33.125  0.853913  32.0
A-               1.0  1.0  ...      10.50  10.5   1.0  33.000       NaN  33.0


         25%    50%     75%   max
Grade
A      32.75  33.25  33.625  34.0
A-     33.00  33.00  33.000  33.0

[2 rows x 56 columns]